using System;

namespace HW7_CSharp
{
    class Program
    {
        struct ComplexNum
        {

        }
        static void Main(string[] args)
        {
            //  1.  Создайте структуру, описывающую комплексное число. Реализуйте арифметические операции
            //      с комплексными числами: сумму, разность, умножение, деление.

            //  2.  Реализовать структуру "Автомобиль" (длина, клирес (высота посадки), объем двигателя,
            //      мощность двигателя, диаметр колес, цвет, тип коробки передач). Создайте функции для
            //      задания значений, отображения значений, поиска значений.




        }
    }
}
