using System;

namespace HW9_CSharp
{
    class Program
    {
        static void Main(string[] args)
        {
            /*      Разработать абстрактный класс "Геометрическая Фигура" с методами 
             * "Площадь фигуры" и "Периметр Фигуры". Разработать классы наследники:
             * Треугольник, квадрат, Ромб, прямоугольник, параллелограмм, трапеция,
             * круг, Эллипс. Реализовать конструкторы, которые однозначно определяют
             * объекты днных классов.
             *      Реализовать класс ЭСоставноая фигураЭ, который может состоять 
             * из любого количества "Геометрических фигур". Для данного класса 
             * определить метод нахождения площади фигуры. Создать диаграмму 
             * взаимоотношений классов.
             * 
             */
        }
    }
}
