using System;

namespace HW12_CSharp
{
    class Program
    {
        static void Main(string[] args)
        {
            // Написать класс Money, предназначенный для хранения денежной суммы(в гривнах и копейках). 
            // Для класса реализовать перегрузку операторов +(сложение денежных сумм), -(вычитание сумм), 
            // /(деление суммы на целое число), *(умножение суммы на целое число), ++(сумма увеличивается 
            // на 1 копейку), --(сумма уменьшается на 1 копейку), <, >, ==, !=.
            Console.WriteLine("That's a modified file! ");

            
        }
    }
}
