using System;

namespace HW15_CSharp
{
    internal class Program
    {
       

        static void Main(string[] args)
        {

            //1.Создать делегат.Тип функций делегата выбрать самостоятельно.
            //2.Сделать 3 - 5 методов, соответствующих типу делегата.
            //3.Создать 3 экземпляра делегата, добавив в каждый из них разное кол-во методов в разном порядке.
            //4.Написать метод, принимающий делегат в качестве параметра.Метод должен запрашивать у пользователя 
            //    входные параметры, вызывать делегат с этими параметрами и выводить результат работы делегата.
            //5.Написать метод, аналогичный методу из п. 4 данного задания, но добавить туда multicast - вызов 
            //    переданного делегата, вывести результат работы всех методов делегата для введенных параметров.

            

        }
    }
}
